<meta http-equiv="Content-Type" content="text/html; charset=utf-8">

<?php
header('Content-Type: text/html; charset=utf-8');

function br(){
	echo "<br>";
};

//================ 1
$name = 'Maxim';
//================ 1


//================ 2
$age = (int) 23;
//================ 2


//================ 3
echo "Меня зовут: {$name}";
br();
//================ 3


//================ 4
echo "Мне {$age} лет";
br();
//================ 4


//================ 5
if($age >= 18 && $age <= 59) echo "Вам еще работать и работать";
br();
//================ 5


//================ 6
//================ 7
//================ 8
if($age >= 18 && $age <= 59) echo "Вам еще работать и работать";
elseif ($age > 59) echo "Вам пора на пенсию";
elseif ($age >= 0 && $age <= 17) echo "Вам еще рано работать";
elseif ($age < 0 || $age !== int) echo "Неизвестный возраст";
//================ 6
//================ 7
//================ 8


//================ 9
$day = 0;
br();
//================ 9


//================ 10
//================ 11
//================ 12
switch ($day) {
case 1:
	echo "Это рабочий день";
	break;
case 2:
case 3:
case 4:
case 5:
	echo "Это рабочий день";
	break;
case 6:
case 7:
	echo "Это выходной день";
	break;
default:
	echo "Неизвестный день";
}
br();
//================ 10
//================ 11
//================ 12


//================ 13
$s = 100;
$t = 1;
$kmch = $s / $t;
$kms = $kmch / 3.6;

echo "Скорость авто = $kmch км/час или $kms м/cек";
br();
//================ 13


//================ 14
$foo = 'bar';
$bar = 10;

echo "{${$foo}}";
br();
//================ 14


//================ 15
$a = (int) 7;
$b = (int) 0;
$operator = '/';

switch ($operator){	
	case '+':
		echo $a + $b;
		break;
	case '-':
		echo $a - $b;
		break;
	case '*':
		echo $a * $b;
		break;
	case '/':
		if ($a != 0 && $b != 0) echo $a / $b;
		else echo "На ноль делить нельзя!";
		break;
	case '%':
		if ($a != 0 && $b != 0) echo $a % $b;
		else echo "На ноль делить нельзя!";
		break;
}
br();
//================ 15


//================ 16
$a = (int) 4;
$b = (int) 2;

echo ($a > $b) ? $a : $b;
br();
//================ 16


//================ 17
$a = '78';
$b = 78;

if ($a == $b) {
	echo "Равны";
} else echo "Не равны";
br();
//================ 17


//================ 18
$a = '78';
$b = 78;

if ($a === $b) {
	echo "Эквивалентны";
} else echo "Не эквивалентны";
br();
//================ 18


//================ 19
$a = '78';
$b = 78;

var_dump($a == $b);
br();
//================ 19


//================ 20
//================ 21
//================ 22
$q = 20;
$q1 = 0;
$q2 = -20;
$w = (boolean) $q1;

var_dump($w);
br();

// Любое число, положительное или отрицательное, кроме 0, преобразовываются в TRUE, иначе FALSE.
//================ 20
//================ 21
//================ 22


//================ 23
$string = "Это строка";

echo $string;
br();

print($string);
br();

printf($string);
br();
//================ 23


//================ 24
$my_first_string = "Первый коммент".PHP_EOL;
$my_second_string = "Второй коммент".PHP_EOL;

$file = 'string.txt';


$read = file_get_contents($file);
$read .= $my_first_string;
file_put_contents($file, $read);


$file_open = fopen('string.txt', 'a+t');
$write = fwrite($file_open, $my_second_string);
fclose($file_open);


$result = file_get_contents($file);
echo $result;


# ахаха, я взялся записывать комментарии в файл. 
// получилось найти только 2 способа.
/*
	было познавательно)
*/
//================ 24


//================ 25
$str = "&lt; ?php &lt; ?=";
echo htmlspecialchars_decode($str);

// &lt;?php - мы пишем когда хочем начать написать разнообразный код на PHP
// &lt;?= - мы пишем когда хочем просто вывести информацию на экран = echo.
//================ 25


//================ 26
define("DAYS_COUNT", 7);
const MONTH_COUNT = 12;
//================ 26


//================ 27
// chcp 65001 - ставим кодировку utf-8 в коммандной строке
// php 27.php - открываем файл в php интерпретаторе
//================ 27